#ifndef MMA8451_I2C_H
#define MMA8451_I2C_H
//------------------------------------------------

//------------------------------------------------
//  マクロ定義(Macro definition)
//------------------------------------------------

//------------------------------------------------
//  型定義(Type definition)
//------------------------------------------------
typedef enum MMA8451Status
{
  kMMA8451Ok = 0,
  kMMA8451Error = 1
} MMA8451Status;

typedef struct
{
  float x;
  float y;
  float z;
} MMA8451Gravity;

//------------------------------------------------
//  プロトタイプ宣言(Prototype declaration)
//------------------------------------------------

MMA8451Status mma8451_init();
void mma451_read_gravity(MMA8451Gravity *);

//------------------------------------------------
#endif